package com.example.coolinaria;

public class Utils {

//Общепит 1
    public static  final String RAZDOLIE_TITLE = "Раздолье";
    public static  final String RAZDOLIE_ADRESS = "Адрес: Московское ш., 4б\n";
    public static  final String RAZDOLIE_OTHER = "Средняя оценка:4.0 \n\n" +
            "Телефон: 8 (842) 265-74-14 \n\n" +
            "Время работы: Круглосуточно \n\n" +
            "Отзывы посетителей:\n"+"Помещение большое, подходит для проведения торжеств.\n\n" +
            "Еда от раза к разу все хуже.\n\n" +
            "Неплохое заведение, но не все блюда вкусные.  ";
    //Общепит 2
    public static  final String JAPONIKA_TITLE = " Японика ";
    public static  final String JAPONIKA_ADRESS = "Адрес: ул. Рябикова, 75, Ульяновск ";
    public static  final String JAPONIKA_OTHER = "Средняя оценка: 4.2  \n\n" +
            "Телефон: 8 (842) 292-69-69 \n\n" +
            "Время работы: 10:00 - 1:00 \n\n" +
            "Отзывы посетителей:\n"+"Рис в суши самый вкусный, васаби не разбавленный, соевый соус насыщенный.\n\n" +
            "\"Качество просто супер ！спасибо вам ребята за вкуснейшую пиццу \n\n" +
            "\"Порадовало наличие итальянской кухни, я большой любитель пасты и пиццы.\"  ";

    //Общепит 3
    public static  final String BURGERKING_TITLE = "Бургер Кинг ";
    public static  final String BURGERKING_ADRESS = "Адрес:70в, ул. Рябикова, 70с1 \n\n" +
            "ул. Гончарова, 23\n\n" +
            " ТРЦ \"Аквамолл\", Московское ш., 108\n";
    public static  final String BURGERKING_OTHER = "Средняя оценка: 4.1 \n\n" +
            "Телефон: 8 (800) 700-32-32 \n\n" +
            "Время работы:9:00 - 22:00 \n\n" +
            "Отзывы посетителей:\nЗаказывала катрошку фри и чай всё очень понравилось, буду рекомендовать друзьям.\n\n" +
            "Хорошее место для встреч с друзьями\n\n" +
            "Еда хорошая,но в самом зале грязь( баки переполнены, везде бумага от бургеров)  ";

    //Общепит 4
    public static  final String McDONALDS_TITLE = " Макдональдс ";
    public static  final String McDONALDS_ADRESS = "Адрес:Ульяновский пр., 1a, Ульяновск, Ульяновская обл., 432072\n\n" +
            "2 этаж, ТРЦ Аквамолл, Ульяновская обл., Московское ш., 108\n\n" +
            " ул. Гончарова, 21А\n\n" +
            " Московское ш., 91а";
    public static  final String McDONALDS_OTHER = "Средняя оценка: 4.4 \n\n" +
            "Телефон: 8 (842) 279-44-38 \n\n" +
            "Время работы: 7:00 - 00:00  \n\n" +
            "Отзывы посетителей: Есть 4 терминала для заказа по банковской карте, есть место ожидания.\n\n" +
            "Хорошее местоположение, приятный интерьер и музыка\n\n" +
            "Взяли с собой кофе в дорогу, быстро все сделали, вроде единственный мак в городе";
}