package com.example.coolinaria;

public class Utils {

//Рецепт 1
    public static final String TATAKI_TITLE = "Роллы из говядины татаки";
    public static final String TATAKI_DESCRIPTION = "Татаки – это японский способ быстрого приготовления рыбы или мяса. В идеале жарится мясо или рыба на открытом огне, но если мангала под рукой нет, подойдет и обычная сковорода. Продукт остается почти сырым, так что вы должны быть уверены в его качестве.";
    public static final String TATAKI_RECIPE = "ИНГРЕДИЕНТЫ\n" +
            "\n" +
            "    500 г говяжьей вырезки\n" +
            "    по 1 большому сладкому зеленому и красному перцу\n" +
            "    1 средняя морковка\n" +
            "    пучок зеленого лука\n" +
            "    пучок кинзы\n" +
            "    2 красных перца чили (по желанию)\n" +
            "    2 ч. л. семян черного и белого кунжута\n" +
            "    1 ст. л. растительного масла\n" +
            "    4 ст. л. соевого соуса\n" +
            "    1 ст. л. кунжутного масла\n" +
            "    1 ч. л. сахара\n" +
            "ПОШАГОВЫЙ РЕЦЕПТ ПРИГОТОВЛЕНИЯ\n" +
            "Шаг 1\n" +
            "Роллы из говядины татаки. Шаг 1\n" +
            "Разогрейте антипригарную сковородку на сильном огне. Смажьте филе говядины растительным маслом, а затем обжарьте по 40 сек. с каждой стороны.\n" +
            "Шаг 2\n" +
            "Роллы из говядины татаки. Шаг 2\n" +
            "Смешайте соевый соус, кунжутное масло и сахар вместе в небольшой миске. Положите мясо на лист фольги и полейте 2 ст. л. этой смеси, плотно заверните. Уберите в холодильник минимум на 1 ч.\n" +
            "Шаг 3\n" +
            "Роллы из говядины татаки. Шаг 3\n" +
            "Очистите морковь, у сладкого перца удалите семена и плодоножки. Если используете острый перец, удалите семена. Все овощи нарежьте одинаковой длинной соломкой. Нарежьте кусочками такой же длины кинзу и зеленый лук.\n" +
            "Шаг 4\n" +
            "Нарежьте говяжью вырезку очень тонкими ломтиками. На каждый ломтик укладывайте по кусочку сладкого перца, моркови, зеленого лука и немного кинзы. Если используете, добавьте полоску острого перца. Полейте овощи заправкой и сверните мясо в рулеты.\n" +
            "Шаг 5\n" +
            "Роллы из говядины татаки. Шаг 5\n" +
            "Переложите рулеты на блюдо и посыпьте кунжутом. Украсьте оставшейся кинзой и подавайте к столу.\n" +
            "Кстати\n" +
            "\n" +
            "Чтобы нарезать вырезку тончайшими ломтиками, положите ее на 30 мин. в морозильник.";

    //Рецепт 2
    public static final String DONBURI_TITLE = "Донбури";
    public static final String DONBURI_DESCRIPTION = "Донбури - разновидность японского фаст-фуда. Японский фаст-фуд - вкусный и полезный. Слово \"донбури\" переводится как \"круглая чаша\". Основа донбури - рис. Разновидностей этого блюда очень много: с мясом, курицей, морепродуктами, овощами, грибами. Предлагаю вам рецепт донбури с свининой.";
    public static final String DONBURI_RECIPE = "ИНГРЕДИЕНТЫ\n" +
            "\n" +
            "    свинина котлеты 400 гр.\n" +
            "    крахмал картофельный 1 ст.л.\n" +
            "    айсберг салат листья 8 шт.\n" +
            "    чеснок зубчики 2 шт.\n" +
            "    лук зеленый перья 3 шт.\n" +
            "    перец черный молотый по вкусу\n" +
            "    соль по вкусу\n" +
            "    соус соевый 3 ст.л.\n" +
            "    уксус рисовый 2 ст.л.\n" +
            "    вино белое сухое 3 ст.л.\n" +
            "    сахар 3 ст.л.\n" +
            "    масло кунжутное 0.5 ч.л.\n" +
            "    имбирь корень 0,5 см.\n" +
            "    кунжут по вкусу\n" +
            "    рис круглозерный 250 гр.\n" +
            "    вода холодная 500 мл.\nПОШАГОВЫЙ РЕЦЕПТ ПРИГОТОВЛЕНИЯ\n" +
            "Шаг 1\n" +
            "Донбури. Шаг 1\n" +
            "Берем емкость, вливаем в нее соевый соус, рисовый уксус, белое сухое вино, добавляем натертый корень имбиря, кунжутное масло и сахарный песок. Тщательно перемешиваем до растворения сахара.\n" +
            "Шаг 2\n" +
            "Донбури. Шаг 2\n" +
            "Кусочки свинины отбиваем с помощью молотка с двух сторон до мягкости и равномерной толщины, немного подсаливаем и перчим их. Затем натираем кусочки свинины с двух сторон картофельным крахмалом так, чтобы крахмал покрывал кусочки мяса тонким слоем. Лишний крахмал необходимо стряхнуть.\n" +
            "Шаг 3\n" +
            "Донбури. Шаг 3\n" +
            "Чеснок чистим и нарезаем крупными пластинками. В сковороду вливаем растительное масло, добавляем нарезанные кусочки чеснока и ставим сковороду на огонь. Обжариваем чеснок на среднем огне и как только кусочки чеснока слегка подрумянятся, извлекаем их из сковороды.\n" +
            "Шаг 4\n" +
            "Донбури. Шаг 4\n" +
            "В сковороду с ароматным чесночным маслом выкладываем подготовленные кусочки свинины и обжариваем их в течение 2 минут с каждой стороны, до получения золотистой корочки. Затем вливаем ранее приготовленный соус, накрываем сковороду крышкой и на сильном огне продолжаем готовить мясо еще 3 минут. Далее переворачиваем кусочки мяса и снова накрываем сковороду крышкой. Готовим мясо еще 4 минуты. За это время соус ароматизирует мясо, уварится и загустеет. Основной показатель готовности – множество мелких пузырьков на поверхности кипящего соуса.\n" +
            "Шаг 5\n" +
            "Донбури. Шаг 5\n" +
            "Когда свинина в соусе будет готова, убираем сковороду с огня, открываем крышку, с помощью ложки зачерпываем немного соуса и поливаем им приготовленные кусочки свинины. Перья зеленого лука мелко нарезаем и добавляем в сковороду (2-3 щепотки). Оставляем мясо еще немного настояться.\n" +
            "Шаг 6\n" +
            "Донбури. Шаг 6\n" +
            "Готовим рис. В кастрюлю вливаем воду и доводим ее до кипения. Когда закипит вода всыпаем рис, солим, накрываем крышкой. Готовим рис на медленном огне в течение 25 минут. В глубокие чаши выкладываем по порции риса. Нарезаем листья айсберга тонкими полосками и выкладываем их на рис.\n" +
            "Шаг 7\n" +
            "Донбури. Шаг 7\n" +
            "Каждый кусочек мяса нарезаем на полоски шириной около 1 см. и выкладываем их поверх салата. Поливаем нарезанное мясо приготовленным соусом, присыпаем небольшим количеством зеленого лука и кунжутом.\n";
    //Рецепт 3
    public static final String LASGANA_TITLE = "Лазанья";
    public static final String LASGANA_DESCRIPTION = "Как приятно в холодный пасмурный осенний день побаловать себя кусочком вкусной лазаньи. Не знаю как у вас,а для меня - это настоящий кусочек солнечной хлебосольной Италии.";
    public static final String LASGANA_RECIPE = "ИНГРЕДИЕНТЫ\n" +
            "\n" +
            "    для теста: мука пшеничная 400 г\n" +
            "    оливковое масло 4 ст.л.\n" +
            "    яйца 4 шт.\n" +
            "    для лазаньи: пармезан 400 г\n" +
            "    для соуса бешамель: мука 80 г\n" +
            "    молоко 700 мл\n" +
            "    мускатный орех 0,5 ч.л.\n" +
            "    сливочное масло 120 г\n" +
            "    соль по вкусу\n" +
            "    для соуса болоньезе: говядина 500 г\n" +
            "    морковь 1 шт.\n" +
            "    оливковое масло 3 ст.л.\n" +
            "    чеснок 3 зубчика\n" +
            "    мята (свежая) 2-3 веточки\n" +
            "    расное сухое вино 250 мл\n" +
            "    черный молотый перец 1 щепотка\n" +
            "    орегано (сухой) 1 щепотка\n" +
            "    соль по вкусу\n" +
            "    базилик свежий 2 веточки\n" +
            "ПОШАГОВЫЙ РЕЦЕПТ ПРИГОТОВЛЕНИЯ\n" +
            "Шаг 1\n" +
            "Замешиваем тесто: Муку просейте в миску, затем добавьте туда взбитые яйца и оливковое масло. Замесите тесто и продолжайте месить около 10 минут, это нужно для его эластичности. Тесто должно получиться достаточно плотным. Заверните его в пищевую пленку и поставьте в холодильник примерно на 1 час. Если у вас также получается тесто густой консистенции, добавьте еще одно яйцо или немного воды.\n" +
            "Шаг 2\n" +
            "Делаем соус болоньезе: Говядину нужно пропустить через мясорубку. Томаты опустите в кипяток на 2-3 минуты, это нужно для того, чтобы с них легко сошла кожица. Затем эти овощи также нужно пропустить через мясорубку. Морковь и лук нужно очистить. Затем натрите морковь на терке, а лук нарежьте. Теперь обжарьте овощи на оливковом масле. Не выключая огонь, добавьте фарш и обжарьте еще 8-9 минут. Далее добавьте томаты и тушите еще немного, чтобы выпарился сок. Чеснок мелко нарубите, мяту с базиликом нашинкуйте. В фарш добавьте чеснок, зелень и красное вино. В самом конце добавьте соль и сухие специи. Тушите еще 5 минут.\n" +
            "Шаг 3\n" +
            "Готовим соус бешамель: Сливочное масло растопите в сотейнике. Следующим шагом нужно добавить просеянную муку. Следите, чтобы не было комочков, эту массу нужно хорошо размешать. Теперь вливайте тонкой струйкой молоко, не забывая все время помешивать. Доведите жидкость до кипения, добавьте мускатный орех, соль и варите до загустения\n" +
            "Шаг 4\n" +
            "Подготавливаем тесто - Достаньте его из холодильника, затем для удобства его можно разделить на несколько частей. Раскатайте тесто максимально тонко. Вы можете нарезать его по стандартному размеру листов для лазаньи. Это 10х15 сантиметров. А можете раскатать пласты теста, по размеру соответствующие дну вашей формочки.\n" +
            "Шаг 5\n" +
            "Теперь смажьте форму для запекания оливковым или сливочным маслом. Формируем и запекаем блюдо. Первым слоем выкладывайте тесто, затем густо смажьте его соусом бешамель. Чтобы листы теста не были сухими и жесткими, их можно немного проварить. Также можно использовать больше соуса и накрыть форму для выпечки фольгой.\n" +
            "Шаг 6\n" +
            "Далее кладите слой соуса болоньезе и посыпьте его тертым сыром. Затем снова слой теста, слой бешамель, слой болоньезе и слой сыра. Делайте столько слоев, на сколько у вас хватит ингредиентов. Нагрейте духовку до 200 градусов и выпекайте лазанью от 30 до 40 минут.\n" +
            "Шаг 7\n" +
            "В конце вынимаем из духовки, слегка остужаем и режем на порционные кусочки и раскладываем по тарелкам.\n";
    //Рецепт 4
    public static final String GLINTVINE_TITLE = "Глинтвейн";
    public static final String GLINTVINE_DESCRIPTION = "Глинтвейн – горячее вино – в идеальном исполнении можно попробовать на альпийских склонах. Во Франции и Швейцарии его называют «вэн шо» (vin chau, горячее вино), в Германии – «глювайн» (то же самое, от немецкого gluhende Wein).";
    public static final String GLINTVINE_RECIPE = "ИНГРЕДИЕНТЫ\n" +
            "\n" +
            "    красное сухое вино - 600 мл\n" +
            "    бехеровка (травяной ликер) - 60 мл\n" +
            "    вишневый сок - 280 мл\n" +
            "    лимонный сок - 40 мл\n" +
            "    сахарный сироп с палочкой корицы - 80 мл\n" +
            "    апельсин, лимон, гвоздика, анис\n" +
            "\n" +
            "ПОШАГОВЫЙ РЕЦЕПТ ПРИГОТОВЛЕНИЯ\n" +
            "Шаг 1\n" +
            "Апельсин и лимон нарезать дольками .\n" +
            "Шаг 2\n" +
            "Вылить в кастрюлю вино. Добавить бехеровку, вишневый сок, лимонный сок, гвоздику, анис, дольки лимона и апельсина, сироп с корицей.\n" +
            "Шаг 3\n" +
            "Нагревать при температуре 70-80 градусов 6-7 минут. Дать настояться пару минут.\n";
//Рецепт 5
}
